app/Controllers/Dashboard/Kategori.php

    public function index()
    {
        $data['title'] = 'Daftar Kategori';
        $data['data_kategori'] = $this->kategoriModel->orderBy('nama', 'ASC')->findAll();
---
SELECT *
FROM `data_kategori`
ORDER BY `nama` ASC

    public function create()
    {
        $data['title'] = 'Tambah Kategori';
        if($this->validate([
            'nama_kategori' => [
                'rules'     => 'required',
                'errors'    => 'Nama kategori Wajib di isi'
            ]
        ])){
            if($this->kategoriModel->insert(['nama' => $this->request->getPost('nama_kategori')]))
---
INSERT INTO `data_kategori` (`nama`) VALUES ('Sepatu')