app/Controllers/Dashboard/Produk.php

SELECT *
FROM `data_produk`
---
    public function index()
    {
        $data = [
            'title' => 'Daftar Produk',
            'validation' => \Config\Services::validation(),
        ];
        $data['data_produk'] = [];
        $i = 0;
        foreach($this->produkModel->findAll() as $data_produk){

SELECT *
FROM `data_kategori`
---
    public function create()
    {
        $data = [
            'title'     => 'Tambah Produk',
            'kategori'  => $this->kategoriModel->findAll()