app/Controllers/Pages.php

    public function searchStokBySlugAndVariasi($slug, $variasi)
    {
        $this->stokModel->select('*');
        $this->stokModel->select('data_produk.*');
        $this->stokModel->join('data_produk', 'data_stok_produk.id_produk = data_produk.id');
        $this->stokModel->where('url_slug', $slug);
        $this->stokModel->where('ukuran', $variasi);
        return $this->stokModel->get()->getResultArray();
---
SELECT *, `data_produk`.*
FROM `data_stok_produk`
JOIN `data_produk` ON `data_stok_produk`.`id_produk` = `data_produk`.`id`
WHERE `url_slug` = 'converse-chuck-taylor-all-star-70-high-top-sneakers-black-m10w12'
AND `ukuran` = '41'

    public function detail($slug)
    {
        $this->produkModel->select('*, data_produk.nama AS nama_produk');
        $this->produkModel->select('data_kategori.nama AS nama_kategori');
        $this->produkModel->join('data_kategori', 'data_produk.kategori = data_kategori.id_kategori');
        $this->produkModel->where('url_slug', $slug);
        $prod = $this->produkModel->get()->getResultArray();
---
SELECT *, `data_produk`.`nama` AS `nama_produk`, `data_kategori`.`nama` AS `nama_kategori`
FROM `data_produk`
JOIN `data_kategori` ON `data_produk`.`kategori` = `data_kategori`.`id_kategori`
WHERE `url_slug` = 'converse-chuck-taylor-all-star-70-high-top-sneakers-black-m10w12'

                        session()->setFlashdata('danger', 'Jika kamu ingin melakukan Checkout, harap isi alamat terlebih dahulu!');
                        return view('tambah-alamat', $data);
                    }else{
                        if($this->transaksiModel->insertBatch($produkFixCart)){
---
INSERT INTO `data_transaksi` (`alamat_jalan`, `created_at`, `harga`, `id_buyer`, `kode_trx`, `kuantitas`, `nama_produk`, `status`, `updated_at`, `variasi`) VALUES ('Jl. Kemiri No.34, Kp. Lalang, Sunggal, Kabupaten Deli Serdang, Sumatera Utara 20124,','2024-05-01 19:14:16','1200000',7,'HLM66323218348E6',3,'Converse Chuck Taylor All Star \'70 High Top Sneakers - Black, M10/W12','Menunggu Pembayaran','2024-05-01 19:14:16','41')

    public function produk()
    {
        $data = [
            'title' => 'Produk',
        ];

        $keyword = $this->request->getVar('keyword');
        if($keyword) {
            $data['produks'] = $this->produkModel->search($keyword);
            $data['pager']   = $this->produkModel->pager;
        } else if($this->request->getGet('kategori')) {
            $data['produks'] = $this->getProductByKategori($this->request->getGet('kategori'));
        } else {
            $data['produks'] = $this->produkModel->paginate(5, 'produk_pagers');
            $data['pager']   = $this->produkModel->pager;
        }

        $this->produkModel->select('data_kategori.nama AS nama_kategori');
        $this->produkModel->join('data_kategori', 'data_produk.kategori = data_kategori.id_kategori');
        $kategori = $this->produkModel->findAll();
---
SELECT *
FROM `data_produk`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `data_produk`
SELECT `data_kategori`.`nama` AS `nama_kategori`
FROM `data_produk`
JOIN `data_kategori` ON `data_produk`.`kategori` = `data_kategori`.`id_kategori`

    public function detailOrder($kode_trx = false)
    {
        \Midtrans\Config::$serverKey = 'SB-Mid-server-hByEKJFm3rguW26PywuU7q51';
        \Midtrans\Config::$isProduction = false;
        \Midtrans\Config::$isSanitized = true;
        \Midtrans\Config::$is3ds = true;

        $harga = 0;
        foreach($this->transaksiModel->where('kode_trx', $kode_trx)->findAll() as $d){
            $harga += $d['harga'] * $d['kuantitas'];
        }

        $uri = service('uri');
        $params = array(
            'transaction_details' => array(
                'order_id' => $uri->getSegment(2),
                'gross_amount' => $harga,
            )
        );

        $snapToken = \Midtrans\Snap::getSnapToken($params);

        $data = [
            'title' => 'Detail order',
            'snapToken' => $snapToken
        ];

        $data['data_trx'] = $this->transaksiModel->where('kode_trx', $kode_trx)->findAll();
---
SELECT *
FROM `data_transaksi`
WHERE `kode_trx` = 'HLM66323218348E6'

    public function cancelOrder()
    {
        if($this->validate([
            'kode_trx' => 'required'
        ])){
            if(!$this->transaksiModel->where('kode_trx', $this->request->getPost('kode_trx'))->first()){
                session()->setFlashdata('danger', 'Data transaksi tidak ditemukan');
                return redirect()->to('akun');
            }
            if($this->transaksiModel->set('status', 'Dibatalkan')->where('kode_trx', $this->request->getPost('kode_trx'))->update()){
---
SELECT *
FROM `data_transaksi`
WHERE `kode_trx` = 'HLM66323218348E6'
 LIMIT 1
UPDATE `data_transaksi` SET `status` = 'Dibatalkan', `updated_at` = '2024-05-01 19:14:45'
WHERE `kode_trx` = 'HLM66323218348E6'